In [1]:
import numpy as np
import pandas as pd

In [3]:
diccionario = {'A':[11,12,10,12], 'B':[14,18,16,17]}
dataframe = pd.DataFrame(diccionario, index=['i1','i2','i3','i4'])
dataframe

     A   B
i1  11  14
i2  12  18
i3  10  16
i4  12  17

In [5]:
dataframe['A'].nunique()

3

In [6]:
dataframe['A'].value_counts()

A
12    2
11    1
10    1
Name: count, dtype: int64

In [7]:
def multiplicar(x):
    return x*2

In [8]:
dataframe

     A   B
i1  11  14
i2  12  18
i3  10  16
i4  12  17

In [9]:
dataframe['A'].apply(multiplicar)

i1    22
i2    24
i3    20
i4    24
Name: A, dtype: int64

In [10]:
dataframe['A'].apply(lambda x: x*2)

i1    22
i2    24
i3    20
i4    24
Name: A, dtype: int64

In [11]:
dataframe

     A   B
i1  11  14
i2  12  18
i3  10  16
i4  12  17

In [12]:
dataframe.drop('B',axis=1)

     A
i1  11
i2  12
i3  10
i4  12

In [13]:
dataframe.drop('i1')

     A   B
i2  12  18
i3  10  16
i4  12  17

In [14]:
dataframe

     A   B
i1  11  14
i2  12  18
i3  10  16
i4  12  17

In [15]:
dataframe.columns

Index(['A', 'B'], dtype='object')

In [16]:
dataframe.index

Index(['i1', 'i2', 'i3', 'i4'], dtype='object')

In [20]:
dataframe.sort_values('A')

     A   B
i3  10  16
i1  11  14
i2  12  18
i4  12  17